In [2]:
import pandas as pd
df = pd.read_excel("panda3.xlsx")
df

  tickers            eps  revenue price         people
0  Google          27.82       87    12     Larry page
1     WMT           34.1     -122    23            N.A
2    MSFT          12.56      343    64     Bill gates
3     RIL           32.1       22  1023  Mukesh ambani
4    Tata  not available      190   N.A     Ratan tata

### Convert the people name if name is not there in the people column

In [5]:
def convert_people_cell(cell):
    if cell == "N.A":
        return "new name"
    return cell

def convert_eps_cell(cell):
    if cell == "not available":
        return None
    return cell

df = pd.read_excel("panda3.xlsx", converters = {
    'people': convert_people_cell,
    'eps': convert_eps_cell
})
df

  tickers    eps  revenue price         people
0  Google  27.82       87    12     Larry page
1     WMT  34.10     -122    23       new name
2    MSFT  12.56      343    64     Bill gates
3     RIL  32.10       22  1023  Mukesh ambani
4    Tata    NaN      190   N.A     Ratan tata

In [6]:
df_stocks = pd.DataFrame({
    'tickers': ['Google', 'WMT', 'MSFT'],
    'price': [845, 65, 64],
    'pe': [30.37, 67.98, 12.22],
    'eps': [22, 56, 78]
})

df_weather = pd.DataFrame({
    'day': ['1/1/2222', '2/2/2222', '3/3/2222'],
    'temperature': [32, 3, 45],
    'event': ['Rain', 'Sunny', 'Snow']
})

#### It makes one file which takes above dictionary as a data

In [9]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")